; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-19)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 6 of 19
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 6 of 19
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 19
4. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 7 of 19
5. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 8 of 19
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 19
7. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 8 of 19
8. (pick ball3 roomb right)
   deleted: (at ball3 roomb) (free right)
   added: (carry ball3 right)
   goals met: 8 of 19
9. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 8 of 19
10. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 8 of 19
11. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 9 of 19
12. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 10 of 19
13. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 10 of 19
14. (pick ball19 room5 left)
   deleted: (at ball19 room5) (free left)
   added: (carry ball19 left)
   goals met: 10 of 19
15. (pick ball18 room5 right)
   deleted: (at ball18 room5) (free right)
   added: (carry ball18 right)
   goals met: 10 of 19
16. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 10 of 19
17. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 11 of 19
18. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 12 of 19
19. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 12 of 19
20. (pick ball17 room5 left)
   deleted: (at ball17 room5) (free left)
   added: (carry ball17 left)
   goals met: 12 of 19
21. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 12 of 19
22. (pick ball16 room4 right)
   deleted: (at ball16 room4) (free right)
   added: (carry ball16 right)
   goals met: 12 of 19
23. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 12 of 19
24. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 13 of 19
25. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 14 of 19
26. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 14 of 19
27. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 14 of 19
28. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 14 of 19
29. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 14 of 19
30. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 15 of 19
31. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 16 of 19
32. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 16 of 19
33. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 16 of 19
34. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 16 of 19
35. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 16 of 19
36. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 17 of 19
37. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 18 of 19
38. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 18 of 19
39. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 18 of 19
40. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 18 of 19
41. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 19 of 19
